{
	"tutorialSteve": {
		"leadin": [
			"Steve enters through the double doors, looks to you like he is from 2015 CE.",
			"You: Hello Sir, welcome to the Eternal Revenue Service, How can I help you?",
			"Steve: Hi, I’m Tutorial Steve! I’m here to teach you how to help people like me with tax forms!"
		],
		"leadout": [
			"You: Here you go, you’re all set.",
			"Steve: Well done! You've successfully gotten the form that I need to fill out for me!",
			"You: Hooray! Uh, wait I knew that...",
			"Steve fills out his form.",
			"Steve: Now that I’ve taught you how to complete your duties, I will be on my way! For you no longer need my guidance, you have learned well and…",
			"You: Skip!",
			"Steve: Farewell!",
			"Steve exits through the double doors, back to his own time.",
		],
		"level": "warehouse_1",
		"frames": [
			{
				"display": "Find out how to Help Steve.",
				"options": [
					{
						"display": "OK! So what do we do now?",
						"response": [
							"Steve: Well my friend I need to fill out a form reporting my income alongside paying my taxes to avoid incurring interest and penalties!",
							"You: You’d think I would know this stuff working at the ERS for as long as I have.",
							"Steve: Haha! No matter! You’re doing a fantastic job I must say! So, I am currently making 57,000 USD of income, what form do I need to fill out?"
						],
						"progress": true
					},
					{
						"display": "Your name is Tutorial Steve? Are you kidding?",
						"response": [
							"Steve: Well my good man that is the name my mother gave me! Haha, but I rather enjoy the name Steve if I really think about it!",
							"You: Well actually I meant... never mind..."
						],
						"progress": false
					},
					{
						"display": "2015 huh? How's that working out for you?",
						"response": [
							"Steve: Oh times are great! Sure there’s turmoil looming over our heads in both the news and our daily lives but that’s not a problem as long as you have an upbeat attitude, right buddy?",
							"You: Right! That’ll pass in a few years anyway! You guys still have the apocalypse to look forward to!"
							"Steve: Yeah! Totally… Eh  wait, what was that?"
							"You: Say what? Oh nothing, anyway…!"
						],
						"progress": false
					}
				]
			},
			{
				"display": "Get the correct form for Steve.",
				"options": [
					{
						"display": "I’m sorry, but ‘Tutorial’, isn’t a real name.",
						"response": [
							"Steve: Tutorial was my father’s name and his father’s before him!",
							"You: That doesn’t sound like a name to me.",
							"Steve: Tutorial was my father’s name and…",
							"You: Yes! OK! Skip!"
						],
						"progress": false
					},
					{
						"display": "Let's see, form 802 sounds right...",
						"response": [
							"Steve: That’s the one! Well done! You’re well on your way to becoming a great ERS employee!",
							"You: Thanks! I sure am lucky you were the first guy who came in today! Almost like it was scripted!"
							"*ERR: function returned Null = Invalid Input;"
							"You: … um"
							"Steve: You’ll find the form though that door there!"
						],
						"progress": true
					},
					{
						"display": "How am I supposed to know? I just work at the front desk.",
						"response": [
							"Steve: Haha! not to worry my friend! If i didn’t know exactly how to tell someone what to do and how to do it my name wouldn’t be…",
							"You: Tutorial?",
							"Steve: Wow, how’d you know what I was going to say?",
							"You: I’ve had this conversation before. Many times. The form?",
							"Steve: But of course! the form I need is form 802! Should be in the top drawer of the filing cabinet you’ve got back there!"
						],
						"progress": false
					}
				]
			},
			{
				"display": "Last questions for Steve?",
				"options": [
					{
						"display": "Aren't you curious why this place is called the 'Eternal' Revenue Service?",
						"response": [
							"Steve: Well as a matter of fact, I know it because the ERS exists outside of space and time in a pocket universe where concepts that are commonplace in my universe, like gravity and physics, are thrown into wild conundrums and paradoxes… Much like the IRS does with taxes.",
							"You: ... What? I’m sorry I lost you after ‘commonplace’.",
							"Steve: Haha! yep, just like the IRS…"
						],
						"progress": false
					},
					{
						"display": "Let me just grab that form for you...",
						"response": [
							"You leave for the Warehouse."
						],
						"progress": true
					},
					{
						"display": "What just happened?",
						"response": [
							"Steve: What do you mean?",
							"You: You just said something like… like… a computer?",
							"Steve: I don’t understand. You must have misheard me."
							"You: Well neither do I, what…"
							"Steve: I don’t understand. You must have misheard me."
							"You: Oh forget it, It’s not like weirder things haven’t come through here."
							"Steve: Hi! I’m Tutorial Steve!"
							"You: NO NO, we’re past that part!"
						],
						"progress": false
					}
				]
			}
		]
	}
	"Shirley Ann Jackson": {
		"leadin": [
			"Shirley enters through the double doors, looks to you like she’s from the year 2017 CE",
			"You: Hello Miss, welcome to the Eternal Revenue Service, now handling close encounters of the third kind restraining orders! What service can I provide?”",
			"Shirley: Hello, You have witnessed the Honorable Shirley Ann Jackson, and she has come here today by order of the Interdimensional Postal Service. Who dares speak for this organization!"
			"You: Ooh! I get paid to talk with clients!"
			"Shirley: What is the meaning of summoning the Honorable Shirley Ann Jackson for these outrageous claims!?"
			"You: Well Mrs. Jackson…"
			"Shirley: You may address Shirley as The Honorable Shirley Ann Jackson!"
		],
		"leadout": [
			"You: Here you go."
			"Shirley: Shirley wishes she could say that it’s been a pleasure, but the next time we meet it will probably be because she is shutting the ERS down."
			"You: You can try Mrs. Jackson, but I think you’ll find that the ERS is very… resilient."
			"Shirley: … touche."
			"Shirley departs through the double doors, back to her own time."
		],
		"level": "warehouse_2",
		"frames": [
			{
				"display": "Move the conversation along.",
				"options": [
					{
						"display": "(Sidestep Shirley's comment)",
						"response": [
							"You: Alright, How about you tell me what brought you to the ERS today?"
							"Shirley: Shirley already said, The IPS."
							"You: The company that makes adhesives?"
							"Shirley: Wha… No, the Interd.. The notice Shirley got in the mail! Something about Shirley’s car being heavy."
							"You: Ok, tell me about this car."
							"Shirley: Well as you probably know, ever since what happened in 2016, Shirley has changed her primary mode of transportation to the 2011 amphibious heavy-armor assult vehicle."
							"You: But of course, please continue."
							"Shirley: So just yesterday Shirley receives a notice from your department that she now needs to pay extra taxes because of this! Explain!"
						],
						"progress": true
					},
					{
						"display": "Is that a legal part of your name?",
						"response": [
							"Shirley: That name was given to Shirley by the greatest woman in her life."
							"You: Aww! Your mom gave you that name?"
							"Shirley: What? No, The Honorable Shirley Ann Jackson gave Shirley that name!"
							"You: …Are you going to keep referring to yourself in the third person?"
						],
						"progress": false
					},
					{
						"display": "What's so honorable about her?",
						"response": [
							"Shirley: You dare to challenge the Honorable Shirley Ann Jackson??"
							"You: I’m not challenging! I was just curious!"
							"Shirley: This action is new to Shirley, she will have to think about how she will punish you for these heinous actions."
							"You: Wait, is challenging new to you or is curiosity new to you?"
							"Shirley: ...Yes."
						],
						"progress": false
					}
				]
			},
			{
				"display": "Help Shirley get the form she needs.",
				"options": [
					{
						"display": "I don’t believe I’ve introduced myself...",
						"response": [
							"Shirley: I have no interest sir! The Honorable Shirley Ann Jackson is an important woman! Who has many responsibilities and places to be!"
							"You: So then shouldn’t you have sent someone else to come take care of this? "
							"Shirley: Shirley has never been outside the Universe, she wanted to see it for herself."
							"You: Oh… Well what do you think?"
							"Shirley: …"
							"Shirley: Eh, Shirley has seen more interesting places."
						],
						"progress": false
					},
					{
						"display": "Aha, Form 2290",
						"response": [
							"Shirley: Elaborate."
							"You: Well Plankton, Form 2290 is for figuring and paying the tax due on heavy highway vehicles."
							"Shirley: You must be joking! Why can’t Shirley have a heavy assault vehicle without paying extra for damaging public property! This is outrageous!"
							"You: You’re welcome to file a complaint."
							"Shirley: Does someone respond to those?"
							"You: Hmm, I don’t know, but the last guy who went looking for the complaints department came back aged 200 years."
							"Shirley: eehh..."
							"You: He said they listened to his complaint though."
							"Shirley: Go get the form…"
						],
						"progress": true
					},
					{
						"display": "Where exactly are you driving this vehicle?",
						"response": [
							"Shirley: Where else would Shirley take it? To the office, home, anywhere Shirley needs to attend."
							"You: You’re driving it in public areas? Isn’t that a little excessive?"
							"Shirley: Did you forget what happened in 2016? Anyone who goes outside in a simple car is Doomed to a horrible demise."
							"You: ...of course, you’re right, but indescribable horrors aside, the ERS codes are the ERS codes."
							"Shirley: Don’t you mean the law’s the law?"
							"You: There are no laws outside of the universe, just death and taxes."
						],
						"progress": false
					}
				]
			}
		]
	}
	"Future You": {
		"leadin": [
			"A future version of you steps through the double doors, you have no idea where he is from."
			"You: Hello Sir, welcome… wait… is that?"
			"Future You: Well hello there me."
			"You: Huh, this is new. You’re me?"
			"Future You: Yeah, that’s what I said, but I’m getting used to it."
		],
		"leadout": [
			"Past You: Hello Sir, welcome… wait… is that?"
			"You: Well hello there me."
		],
		"level": "warehouse_4",
		"frames": [
			{
				"display": "Learn more about yourself.",
				"options": [
					{
						"display": "How did you get here?",
						"response": [
							"Future You: To be honest, no idea, and the experience was rather traumatic so…"
							"You: Aw come on, tell me more!"
							"Future You: You should count yourself lucky that you don't know! It was insane!"
							"You: You're not helping me get over this…"
						],
						"progress": false
					},
					{
						"display": "Where are you from?",
						"response": [
							"Future You: I’m from the future, only about five minutes in the future, but still"
							"You: Wow, how is the future?"
							"Future You: …it’s not bad."
							"You: Well I guess time does pass in the ERS after all!"
							"Future You: Yeah, but don’t bother trying to remember how much time has passed, you can’t remember."
							"You: How would you kno… Oh right, future ‘ME’."
						],
						"progress": false
					},
					{
						"display": "Well, can I get you something?",
						"response": [
							"Future You: YES. I need a form for Future me."
							"You: Future you?"
							"Future You: Yeah, he came in from my future asking for a form and when I went to get it I ended up here."
							"You: Weird, well I should be able to get it for you, what’s the form?"
							"Future You: No idea."
							"You: …"
							"Future You: Future me said I would know it when I see it."
							"You: Alright, I guess the same goes for me then?"
							"Future You: Yeah, you’ll know it when I see it. I mean you, you see it, heh, heh."
							"You: Well it might take a while, you think you can watch the desk for me?"
							"Future You: Sure, but try to be quick, I got future me watching my desk."
						],
						"progress": true
					}
				]
			}
		]
	}
	"Alien": {
		"leadin": [
			"An alien being enters through the double doors, it looks to you like it is from the year 6730 AE"
			"You: Hello Sir, welcome to the Eternal Revenue Service, Not even your death can stop us. How are you today?"
			"Alien: Lleho, I ndee a mfor ot gsin."
			"You: Oh sorry, fO ocures, athw rofm do uyo eend?"
			"Alien: Odsen’t taterm, ew jtsu edne to kaem it seem leik oesmtnhig rmtioptna si pnpaehing"
		],
		"leadout": [
			"Alien: Lcoo, thnksa orf royu elph, onec I eealv shit orom l'lI ecsea ot xesit, acuebse 'mi utjs a ecaharrct ni a maeg."
			"You: uortfh alwl rbagiekn aised, I poeh ti aws a oogd ielf."
			"Alien: Nsohytle, I erfrpe bovilion."
			"The alien departs through the double doors, back to his own time."
		],
		"level": "warehouse_5",
		"frames": [
			{
				"display": "Learn more about the very interesting alien being.",
				"options": [
					{
						"display": "Ho I ese, os htis si usjt a lilfer esemgtn.",
						"response": [
							"Alien: Nto os cumh a flilre sa a ehacp adn esya uglha"
							"You: Oh ahey, eoppel olevs shtoe!"
							"Alien: Naydc mrfo a baby."
						],
						"progress": false
					},
					{
						"display": "Lewl atth’s a ibg ohicce ot kame, vhea oyu esen htta raeowheus?",
						"response": [
							"Alien: Ho orsyr, I frootg. Mhm, ohw boaut a praikgn rmepti?"
							"You: Taht’s a llteti obrign dno’t you hntki?"
							"Alien: Hyea, m’I a robing ygu... I no'td ende a psaoyernlit, eppole anc't veen rntdauesnd em..."
						],
						"progress": false
					},
					{
						"display": "Os I uclod tielrlayl grba yna ofrm?",
						"response": [
							"Alien: Rsue I susge."
							"You: Ohld no ’llI gte uyo a ceniesl ot lkli…"
						],
						"progress": true
					}
				]
			}
		]
	}
	"Henry VIII": {
		"leadin": [
			"Henry VIII enters through the double doors, looks to you like he is from the year 1533 CE*"
			"You: Hello Sir, welcome to the Eternal Revenue Service, If you’re looking for the 7th dimension you’ve gone too far. How can I make your day brighter?"
			"Henry: Greetings peasant, I wish to speak with your master I have business with him."
			"You: I have business with the toilet but my break is not for another…"
			"You: Um… not for another while."
		],
		"leadout": [
			
		],
		"level": "warehouse_",
		"frames": [
			{
				"display": "",
				"options": [
					{
						"display": "",
						"response": [
						],
						"progress": false
					},
					{
						"display": "",
						"response": [
						],
						"progress": false
					},
					{
						"display": "",
						"response": [
						],
						"progress": false
					}
				]
			},
			{
				"display": "",
				"options": [
					{
						"display": "",
						"response": [
						],
						"progress": false
					},
					{
						"display": "",
						"response": [
						],
						"progress": false
					},
					{
						"display": "",
						"response": [
						],
						"progress": false
					}
				]
			}
		]
	}
	"Name": {
		"leadin": [
			
		],
		"leadout": [
			
		],
		"level": "warehouse_",
		"frames": [
			{
				"display": "",
				"options": [
					{
						"display": "",
						"response": [
						],
						"progress": false
					},
					{
						"display": "",
						"response": [
						],
						"progress": false
					},
					{
						"display": "",
						"response": [
						],
						"progress": false
					}
				]
			},
			{
				"display": "",
				"options": [
					{
						"display": "",
						"response": [
						],
						"progress": false
					},
					{
						"display": "",
						"response": [
						],
						"progress": false
					},
					{
						"display": "",
						"response": [
						],
						"progress": false
					}
				]
			},
			{
				"display": "",
				"options": [
					{
						"display": "",
						"response": [
						],
						"progress": false
					},
					{
						"display": "",
						"response": [
						],
						"progress": false
					},
					{
						"display": "",
						"response": [
						],
						"progress": false
					}
				]
			}
		]
	}
}
